/**
 * @title javaGold / testExamin / TestPracticeEd.java
 * @reference なし
 * @content [(1) ◆練習問題1.1, (2) ◆練習問題1.2]
 * @author shika
 * @date 2021-02-15
 */
/* Appendix
 * @costTime 07:52 - 07:53 ( 0 分)
 * @correctRate 正答率 100.00 ％ ( 〇3問 / 全3問 )
 */
/* Appendix
 * @costTime 08:18 - 08:20 ( 1 分)
 * @correctRate 正答率 100.00 ％ ( 〇3問 / 全3問 )
 */
/* Appendix
 * @costTime 08:23 - 08:24 ( 0 分)
 * @correctRate 正答率 100.00 ％ ( 〇2問 / 全2問 )
 */
/* Appendix
 * @costTime 08:26 - 08:27 ( 1 分)
 * @correctRate 正答率 75.00 ％ ( 〇3問 / 全4問 )
 */
/* Appendix 
 * @costTime 09:38 - 09:38 ( 0 分) 
 * @correctRate 正答率 100.00 ％ ( 〇2問 / 全2問 )
 */ 
package javaGold.testExamin;

import javaGold.PracticeEditor;

public class TestPracticeEd {

    public static void main(String[] args) {
        new PracticeEditor();
    }//main()

}//class
/*
//====== 2021-02-15 ======
(1) ◆練習問題1.1
〇 (1) A =>
〇 (2) B =>
〇 (1) C =>
(2) ◆練習問題1.2
〇 (1) A =>
〇 (2) B =>
〇 (1) C =>

開始時刻 07:52
終了時刻 07:53
所要時間 0 分
正答率 100.00 ％ ( 〇3問 / 全3問 )
*/

/*
//====== 2021-02-15 ======
 ◆練習問題1.1
〇 （1） 前の（）を全角にして =>
〇 （2） （）の数字だけを消せた =>
〇 （1） これで半角数字もＯＫ =>
 ◆練習問題1.2
〇 （1） 前の（）を全角にして =>
〇 （2） （）の数字だけを消せた =>
〇 （1） これで半角数字もＯＫ =>

開始時刻 08:18
終了時刻 08:20
所要時間 1 分
正答率 100.00 ％ ( 〇3問 / 全3問 )
*/

/*
//====== 2021-02-15 ======
 ◆練習問題1.1
〇 （1） startsWith("[ 1 ]")のままだった =>
〇 （2） startsWith("（1）")に修正 =>

開始時刻 08:23
終了時刻 08:24
所要時間 0 分
正答率 100.00 ％ ( 〇2問 / 全2問 )
*/

/*
//====== 2021-02-15 ======
 ◆練習問題1.1
〇 （1） いや１周だけじゃ =>
Ｘ （2） あかんから =>
 ◆練習問題1.2
〇 （1） やりなおし =>
〇 （2） これでどうよ =>

開始時刻 08:26
終了時刻 08:27
所要時間 1 分
正答率 75.00 ％ ( 〇3問 / 全4問 )
*/
/*
//====== Chapter01 / 2021-02-14 ======
できた！
/＊＊
* @title javaGold / selfLearn / Chapter01.java
* @reference 山田祥寛『独習 Java 新版』 翔泳社, 2019
* @content [[]◆練習問題, []◆章末問題]
* @author shika
* @date 2021-02-14
＊/
*/
/* Appendix
* @costTime 10:50 - 10:51 ( 1 分)
* @correctRate 正答率 85.71 ％ ( 〇6問 / 全7問 )
*/

/* Appendix
* @costTime 11:02 - 11:04 ( 1 分)
* @correctRate 正答率 75.00 ％ ( 〇3問 / 全4問 )
*/
/* Appendix
* @costTime 11:17 - 11:19 ( 1 分)
* @correctRate 正答率 75.00 ％ ( 〇3問 / 全4問 )
*/
/* Appendix
* @costTime 11:24 - 11:27 ( 2 分)
* @correctRate 正答率 50.00 ％ ( 〇2問 / 全4問 )
*/

/*
//====== 2021-02-14 ======
[]◆練習問題
Ｘ [ 1 ] A
〇 [ 2 ] B
〇 [ 3 ] C
[]◆章末問題
〇 [ 1 ] D
〇 [ 2 ] E
〇 [ 3 ] G
〇 [ 4 ] F

開始時刻 10:50
終了時刻 10:51
所要時間 1 分
正答率 85.71 ％ ( 〇6問 / 全7問 )
*/

/*
//====== 2021-02-14 ======
[]◆練習問題２回目
〇 [ 1 ] A =>
〇 [ 2 ] B =>
[]◆章末問題２回目
〇 [ 1 ] 角カッコが =>
Ｘ [ 2 ] 消えない =>

開始時刻 11:02
終了時刻 11:04
所要時間 1 分
正答率 75.00 ％ ( 〇3問 / 全4問 )
*/
/*
//====== 2021-02-14 ======
[  ] ◆練習問題 回目
〇 [ 1 ] 半角数字が消えている =>
〇 [ 2 ] これじゃあかん =>
[  ] ◆章末問題 回目
〇 [ 1 ] ここも 3 4  =>
Ｘ [ 2 ] 消えるかな =>

開始時刻 11:17
終了時刻 11:19
所要時間 1 分
正答率 75.00 ％ ( 〇3問 / 全4問 )
*/

/*
//====== 2021-02-14 ======
◆練習問題４回目
〇 [ 1 ] []消えた！ =>
Ｘ [ 2 ] 半角スペースはtrim()されている =>
◆章末問題回目
Ｘ [ 1 ] 半角数字は やっぱ消える =>
〇 [ 2 ] ここの半角数字は残るからいいか =>

開始時刻 11:24
終了時刻 11:27
所要時間 2 分
正答率 50.00 ％ ( 〇2問 / 全4問 )
*/

/* 
//====== 2021-02-15 ====== 
 「=>」消えたか問題
〇 （1） A   
〇 （2） B   

開始時刻 09:38
終了時刻 09:38
所要時間 0 分
正答率 100.00 ％ ( 〇2問 / 全2問 )
*/ 

